<?
/*

	--- COOKIE ---

			храним не серьезные данные, небезопасны
			Распространяются на определенный домен
			время жизни - по умолчанию время жизни вкладки (можно передать пеараметры времени)


			на клиенте   document.cookie = 'ключ=значение'  - установит
			$_COOKIE - массив с куками на сервере


				Установи куку с сервера - команда браузеру !!! До отправки контента,так как отправляем заголовки !!!
					setcookie(
								'name'                  - имя
								'alex'                  - значение
								time()+60*60*24*30		- срок жизни в милисекундах (месяц)
								'/cookie/'              - путь по сайту, на которую ставится кука (по умолчанию весь домен)
								'admin.step.local'      - поддомен, где доступна кука
								false/true                    - если true, то https протокол
								false/true                    - куки доступны только по http протоколу, защита от xss-атак
					)

				Удалить куку - нужно установить куку с отрицательным временем жизни
				setcookie('name', 'alex', -time()+60);





	--- SESSION ---

			более расширенаая, защищенная
			Можно сохранять массив, в куках нельзя, только строки
			обычно иапользуют для авторизации

			$_SESSION - массив сессии на сервере

			Если в php.ini не стоит session.auto_start в от, То сессию нужно принудительно окрыть
			!!! До отправки контента,так как отправляем заголовки !!!

			session_start() - Запускаем сессию . Сессия открывается для домена. Нужно открывать для каждой страницы.

			Когда открываем сессию,  бросается кука, например PHPSESSID=gftknrob2nokhb1m2a2dtrfc56 (как ключ)
			На сервере создается файл с именем gftknrob2nokhb1m2a2dtrfc56 ( на каждом сервере свой путь, настраивается отдельно ).
			Именно в нем будут все данные сессии.


			уничтожает файлы сессии
			session_unset()
			session_destroy()


			2 примера
				session (основы)
				practis (аналогично session, более расширенный пример)

 */
?>
<?
setcookie('custom', 'value');
session_start();

echo "<pre>";
print_r($_COOKIE);
echo "</pre>";



$_SESSION['name']='Alex';
$_SESSION['role']='admin';

session_unset();
session_destroy();
echo "<pre>";
var_dump($_SESSION);
echo "</pre>";
?>

<?
echo "<pre>";
print_r($_GET);
echo "</pre>";?>
<form action="">
	<input type="checkbox" name="dir[]" value="dir1" checked="checked">
	<input type="checkbox" name="dir[]" value="dir2">
	<button>submit</button>
</form>

